package basic_17120;

public class InheritanceBasic {
	public static void main(String[] args) {
		/*
		 	1. 상속 (~은 ~이다)
		 		-기존의 클래스를 재사용하여 새로운 클래스를 작성한다.
		 		-적은양의 코드로 새로운 클래스를 작성 할 수 있다.
		 		-새로 작성하고자 하는 클래스의 뒤에 생속받고자 하는 클래스의 이름을 키워드 'extends'와 함께 써주기만 하면 된다.
		 		
		 		class Child extends Parent{
		 			
		 		
		 		}
		 		
		 		-상속해주는 클래스를 '조상클래스', 상속받는 클래스를 '자손클래스'라고 한다.
		 			조상클래스 : 부모클래스, 상위클래스, 기반클래스
		 			자손클래스 : 자식클래스, 하위클래스, 파생클래스
	 			-멤버만 상속한다.
	 			-자손클래스의 멤버개수는 조상클래스와 같거나 보다 많다.
		 		
	 		2. 포함(~은 ~을 가지고 있다.)
	 			-상속 이외에 클래스를 재사용 하는 또다른 방법.
	 			-한 클래스의 멤버변수로 다른 클래스를 선언하는 방법이다.
	 			
		 */
	}
}
